app/views/pantries/edit.html.erb

    <div class="form-group">
        <%= f.collection_check_boxes :ingredient_ids, Ingredient.all, :id, :titleize do |b| %>
---
SELECT "ingredients".* FROM "ingredients"