app/controllers/pantries_controller.rb

    def update
        # Adds pantry's ingredients based on checked boxes
        if params[:pantry][:ingredient_ids] != ""
            params[:pantry][:ingredient_ids].each do |ingredient_id|
                @pantry.ingredients << Ingredient.where(id: ingredient_id)
            end
            @pantry.save
        end
        # Finds or adds new ingredients based on filled text fields
        if params[:pantry][:ingredients] != ""
            params[:pantry][:ingredients].each do |k,v|
                if v != ""
                    @pantry.ingredients << Ingredient.find_or_create_by(name: v.downcase)
---
INSERT INTO "ingredients" ("name") VALUES (?)  [["name", "0"]]
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ?  [["id", nil]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."name" = ? LIMIT ?  [["name", "0"], ["LIMIT", 1]]

    def destroy
        @ingredient = Ingredient.find(params[:ingredient_id])
---
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]

    def set_pantry
        @user = current_user
        @pantry = Pantry.find_by(user_id: @user.id)
---
SELECT  "pantries".* FROM "pantries" WHERE "pantries"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]

    def set_ingredients
        @ingredients = Ingredient.all
---
SELECT "ingredients".* FROM "ingredients"