app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
    def index
        @recipes = Recipe.all

INSERT INTO "recipes" ("name", "created_at", "updated_at", "prep_time", "cook_time", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "My Recipe"], ["created_at", "2018-08-02 12:59:21.359150"], ["updated_at", "2018-08-02 12:59:21.359150"], ["prep_time", 30], ["cook_time", 30], ["user_id", 1]]
---
    def create
        @recipe = @user.recipes.build(recipe_params)
        @recipe.directions = params[:recipe][:directions].values.delete_if {|v| v.empty?}
        if @recipe.save

UPDATE "recipes" SET "name" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["name", "My FB Recipe messed up"], ["updated_at", "2018-08-06 12:59:34.944975"], ["id", 5]]
---
    def update
        @recipe.update(recipe_params)

DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 4]]
---
    def destroy
        @recipe.destroy