app/controllers/sessions_controller.rb

  def create
    if params[:user] # Conventional Login
      @user = User.find_by(username: params[:user][:username])
      if @user && @user.authenticate(params[:user][:password])
        session[:user_id] = @user.id
        redirect_to user_path(@user)
      else
        redirect_to signin_path, notice: "Login failed. Please try again."
      end
    elsif auth['uid'] # Facebook Login
      @user = User.find_by(:uid => auth['uid'])
      if !@user # create new user - should be moved to user controller
        @user = User.new(:uid => auth['uid']) do |u|
          u.username = auth['info']['name']
          u.image_url = auth['info']['image']
        end
        @pantry = Pantry.create(user_id: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "hello"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "4395504565585"], ["LIMIT", 1]]
INSERT INTO "pantries" ("user_id") VALUES (?)  [["user_id", 1]]
INSERT INTO "users" ("username", "password_digest", "email", "image_url", "uid") VALUES (?, ?, ?, ?, ?)  [["username", "Marissa Zhong"], ["password_digest", "0"], ["email", "facebook_user"], ["image_url", "http://graph.facebook.com/v2.10/4395504565585/picture"], ["uid", 4395504565585]]