app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
            @pantry = Pantry.create(user_id: @user.id)
---
INSERT INTO "users" ("username", "password_digest", "email") VALUES (?, ?, ?)  [["username", "hello"], ["password_digest", "$2a$10$xmRC.irFOQFUZym9dqFxv.aS9CcXEQayAaOdvecivS9zdy5zcmK3O"], ["email", "hello@hello.com"]]
INSERT INTO "pantries" ("user_id") VALUES (?)  [["user_id", 3]]

    def update
        if @user.update(user_params)
---
UPDATE "users" SET "username" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["username", "marissa2"], ["password_digest", "$2a$10$2Usf1J4rNw6ifIhEyYHI7eZKjHoCRQbCjnG2iA099ST75IxqNoPg2"], ["id", 1]]